countries-server/app/controllers/countries_controller.rb

  def index
    @countries = Country.find_with_join
---
SELECT  "countries".* FROM "countries" right join country_datas on country_datas.name = countries.name  ORDER BY "countries"."id" ASC LIMIT 1